{
  "nodes": [
    {
      "op": "null", 
      "name": "CC_PolTerr_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolTerr_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolTerr_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_CapPop_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_CapPop_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Hier_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Hier_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Govt_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Govt_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Infra_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Infra_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Writing_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Writing_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Texts_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Texts_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Money_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Money_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Money_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CCs_imputed_chars", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolPop_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolPop_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolPop_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolPop_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolPop_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolPop_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolTerr_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolTerr_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolTerr_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolTerr_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_PolTerr_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_PolTerr_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_PolTerr_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_CapPop_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_CapPop_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_CapPop_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_CapPop_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_CapPop_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_CapPop_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_CapPop_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Hier_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Hier_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Hier_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Hier_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Hier_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Hier_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Hier_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Govt_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Govt_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Govt_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Govt_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Govt_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Govt_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Govt_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Infra_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Infra_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Infra_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Infra_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Infra_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Infra_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Infra_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Writing_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Writing_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Writing_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Writing_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Writing_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Writing_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Writing_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Texts_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Texts_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Texts_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Texts_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Texts_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Texts_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Texts_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x0_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x0_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x0_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Money_Regression_x0_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Money_Regression_x0_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x1_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x1_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x1_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Money_Regression_x1_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Money_Regression_x1_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x2_numeric", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x2_numeric_fullyconnected0_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "CC_Money_Regression_x2_numeric_fullyconnected0_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "CC_Money_Regression_x2_numeric_fullyconnected0", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[171, 0, 0], [172, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "CC_Money_Regression_x2_numeric_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat64", 
      "attrs": {
        "dim": "1", 
        "num_args": "36"
      }, 
      "inputs": [
        [4, 0, 0], 
        [9, 0, 0], 
        [14, 0, 0], 
        [19, 0, 0], 
        [24, 0, 0], 
        [29, 0, 0], 
        [34, 0, 0], 
        [39, 0, 0], 
        [40, 0, 0], 
        [45, 0, 0], 
        [50, 0, 0], 
        [55, 0, 0], 
        [60, 0, 0], 
        [65, 0, 0], 
        [70, 0, 0], 
        [75, 0, 0], 
        [80, 0, 0], 
        [85, 0, 0], 
        [90, 0, 0], 
        [95, 0, 0], 
        [100, 0, 0], 
        [105, 0, 0], 
        [110, 0, 0], 
        [115, 0, 0], 
        [120, 0, 0], 
        [125, 0, 0], 
        [130, 0, 0], 
        [135, 0, 0], 
        [140, 0, 0], 
        [145, 0, 0], 
        [150, 0, 0], 
        [155, 0, 0], 
        [160, 0, 0], 
        [165, 0, 0], 
        [170, 0, 0], 
        [175, 0, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "label_CC_PolPop_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_CC_PolPop_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_CC_PolPop", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "CC_PolPop", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus64", 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar64", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum64", 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean64", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar64", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div64", 
      "inputs": [[183, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum129", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar129", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum128", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar128", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul64", 
      "inputs": [[188, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss64", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-CC_PolPop", 
      "inputs": [[179, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    48, 
    51, 
    52, 
    53, 
    56, 
    57, 
    58, 
    61, 
    62, 
    63, 
    66, 
    67, 
    68, 
    71, 
    72, 
    73, 
    76, 
    77, 
    78, 
    81, 
    82, 
    83, 
    86, 
    87, 
    88, 
    91, 
    92, 
    93, 
    96, 
    97, 
    98, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    111, 
    112, 
    113, 
    116, 
    117, 
    118, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    131, 
    132, 
    133, 
    136, 
    137, 
    138, 
    141, 
    142, 
    143, 
    146, 
    147, 
    148, 
    151, 
    152, 
    153, 
    156, 
    157, 
    158, 
    161, 
    162, 
    163, 
    166, 
    167, 
    168, 
    171, 
    172, 
    173, 
    177, 
    178, 
    180
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194
  ], 
  "heads": [[192, 0, 0], [193, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}