{
  "nodes": [
    {
      "op": "null", 
      "name": "ngram_features-brVcqRRLSX", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-7sRWnWHHvy", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-7sRWnWHHvy_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-7sRWnWHHvy_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-7sRWnWHHvy_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-7sRWnWHHvy_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat102", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[0, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_Most_euphoric_ritual_frequency_per_participant_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_Most_euphoric_ritual_frequency_per_participant_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_Most_euphoric_ritual_frequency_per_participant", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "log_softmax", 
      "name": "log_softmax22", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Most_euphoric_ritual_frequency_per_participant", 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar44", 
      "attrs": {"scalar": "0.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar146", 
      "attrs": {"scalar": "10"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser22", 
      "inputs": [[11, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul66", 
      "inputs": [[11, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split22", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "1", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "pick", 
      "name": "pick44", 
      "inputs": [[10, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar45", 
      "attrs": {"scalar": "-1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like22", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater22", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul67", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "__empirical_risk_instance_weight__", 
      "inputs": []
    }, 
    {
      "op": "pick", 
      "name": "pick45", 
      "inputs": [[22, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul68", 
      "inputs": [[21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum124", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar147", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div124", 
      "inputs": [[24, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like22", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum125", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul124", 
      "inputs": [[27, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean102", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar148", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div125", 
      "inputs": [[30, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum205", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar205", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum204", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar204", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul125", 
      "inputs": [[35, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss102", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "softmax22", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-Most_euphoric_ritual_frequency_per_participant", 
      "inputs": [[40, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 3, 7, 8, 11, 22], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42
  ], 
  "heads": [[39, 0, 0], [41, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}