{
  "nodes": [
    {
      "op": "null", 
      "name": "ngram_features-anQRU85hVa", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-sxSb7Mo2jl", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-sxSb7Mo2jl_fullyconnected0_weight", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "numerical_features-sxSb7Mo2jl_fullyconnected0_bias", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "numerical_features-sxSb7Mo2jl_fullyconnected0", 
      "attrs": {"num_hidden": "100"}, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "numerical_features-sxSb7Mo2jl_activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat49", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[0, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label_Measurement_of_length_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "label_Measurement_of_length_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "label_Measurement_of_length", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Measurement_of_length", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "_minus46", 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "_powerscalar46", 
      "attrs": {"scalar": "2.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum52", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "mean49", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar55", 
      "attrs": {"scalar": "1e-05"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div52", 
      "inputs": [[13, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum99", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar99", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "add_n", 
      "name": "elementwisesum98", 
      "attrs": {"num_args": "1"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar98", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul52", 
      "inputs": [[18, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "makeloss49", 
      "attrs": {
        "normalization": "valid", 
        "valid_thresh": "1e-06"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "pred-Measurement_of_length", 
      "inputs": [[9, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 3, 7, 8, 10], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24
  ], 
  "heads": [[22, 0, 0], [23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}